{"version":"1","records":[{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook"},"content":" \n\n\n\n\n\n\n\n\n\nThis Cookbook is a comprehensive showcase of workflows & techniques for visualizing Unstructured Grids using \n\nUXarray,\nalso providing foundational information on unstructured grids.","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl2":"Motivation"},"type":"lvl2","url":"/#motivation","position":2},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl2":"Motivation"},"content":"The ability to natively visualize unstructured grids is much needed within the Scientific Python Ecosystem,\nwhich poses multiple challenges and needs to:\n\nNot regrid the source unstructured grid to structured grid\n\nTake advantage of grid information, such as connectivity variables\n\nLimit the amount of pre-processing needed to prepare the data for Python visualization tools\n\nUXarray enables such visualization methods that operate directly on unstructured grid data, providing\nXarray-styled functionality to better read in and use unstructured grid datasets that follow standard\nconventions.\n\nUXarray supports a variety of unstructured grid formats and file types including UGRID, MPAS, ICON, CAM-SE,\nSCRIP, Exodus, ESMF, GEOS, and FESOM2, and is extensible for other formats.\n\nThis cookbook covers an introduction to unstructured grids and UXarray from a visualization standpoint,\nproviding foundational information about unstructured grids, visualization methods and libraries, and\nintroducing UXarray, and showcasing several UXarray visualization functions and workflows.","type":"content","url":"/#motivation","position":3},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl2":"Authors"},"type":"lvl2","url":"/#authors","position":4},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl2":"Authors"},"content":"Philip Chmielowiec (NSF NCAR)\n\nOrhan Eroglu (NSF NCAR)\n\nRajeev Jain (Argonne National Laboratory)\n\nIan Franda (University of Wisconsin-Madison)\n\nRachel Tam (University of Illinois Urbana-Champaign)","type":"content","url":"/#authors","position":5},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl3":"Contributors","lvl2":"Authors"},"type":"lvl3","url":"/#contributors","position":6},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl3":"Contributors","lvl2":"Authors"},"content":"","type":"content","url":"/#contributors","position":7},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl2":"Structure"},"type":"lvl2","url":"/#structure","position":8},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl2":"Structure"},"content":"This cookbook is split up into several chapters to communicate the content efffectively with different\nlevels of readers:\n\n1. Foundations\n\nHere, we cover overview of the foundational topics necessary to understand the content in this cookbook,\ne.g. what unstructured grids are and how they are different than structured grids, what plotting libraries\nand visualization techniques exist that can be helpful for unstructured grid visualization, and we briefly\nmention how UXarray is related to these.\n\n2. Introduction to UXarray\n\nIn this chapter, we provide an overview of UXarray: An Xarray-extension for unstructured grid-formatted\nclimate and global weather data analysis and visualization.\n\n3. Plotting with UXarray\n\nWe provide an overview of the UXarray plotting API along with several visualization functionality, and cases\nand examples that can be realized using such UXarray functionality; Grid visualization, Data visualization,\nGeographic projections and features, to name a few. Also in this section, customization and interactivaity\nwith UXarray plotting and considerations with high-resolution plotting are also provided.\n\n4. Visualization Recipies\n\nIn this last chapter, we offer to the interested readers a set of focused workflows that can be realized\nwith UXarray, including visualizations of MPAS and E3SM model output.","type":"content","url":"/#structure","position":9},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl2":"Running the Notebooks"},"type":"lvl2","url":"/#running-the-notebooks","position":10},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl2":"Running the Notebooks"},"content":"You can either run the notebook using \n\nBinder or on your local machine.","type":"content","url":"/#running-the-notebooks","position":11},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl3":"Running on Binder","lvl2":"Running the Notebooks"},"type":"lvl3","url":"/#running-on-binder","position":12},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl3":"Running on Binder","lvl2":"Running the Notebooks"},"content":"The simplest way to interact with a Jupyter Notebook is through\n\n\nBinder, which enables the execution of a\n\n\nJupyter Book in the cloud. The details of how this works are not\nimportant for now. All you need to know is how to launch a Pythia\nCookbooks chapter via Binder. Simply navigate your mouse to\nthe top right corner of the book chapter you are viewing and click\non the rocket ship icon, (see figure below), and be sure to select\n“launch Binder”. After a moment you should be presented with a\nnotebook that you can interact with. I.e. you’ll be able to execute\nand even change the example programs. You’ll see that the code cells\nhave no output at first, until you execute them by pressing\nShift+Enter. Complete details on how to interact with\na live Jupyter notebook are described in \n\nGetting Started with\nJupyter.","type":"content","url":"/#running-on-binder","position":13},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl3":"Running on Your Own Machine","lvl2":"Running the Notebooks"},"type":"lvl3","url":"/#running-on-your-own-machine","position":14},{"hierarchy":{"lvl1":"Unstructured Grid Visualization Cookbook","lvl3":"Running on Your Own Machine","lvl2":"Running the Notebooks"},"content":"If you are interested in running this material locally on your computer, you will need to follow this workflow:\n\nClone the https://github.com/ProjectPythia/unstructured-grid-viz-cookbook repository: git clone https://github.com/ProjectPythia/unstructured-grid-viz-cookbook.git\n\nMove into the unstructured-grid-viz-cookbook directorycd unstructured-grid-viz-cookbook\n\nCreate and activate your conda environment from the environment.yml fileconda env create -f environment.yml\nconda activate unstructured-grid-viz-cookbook-dev\n\nMove into the notebooks directory and start up Jupyterlabcd notebooks/\njupyter lab","type":"content","url":"/#running-on-your-own-machine","position":15},{"hierarchy":{"lvl1":"How to Cite This Cookbook"},"type":"lvl1","url":"/how-to-cite","position":0},{"hierarchy":{"lvl1":"How to Cite This Cookbook"},"content":"The material in this Project Pythia Cookbook is licensed for free and open consumption and reuse. All code is served under \n\nApache 2.0, while all non-code content is licensed under \n\nCreative Commons BY 4.0 (CC BY 4.0). Effectively, this means you are free to share and adapt this material so long as you give appropriate credit to the Cookbook authors and the Project Pythia community.\n\nThe source code for the book is \n\nreleased on GitHub and archived on Zenodo. This DOI will always resolve to the latest release of the book source:\n\n","type":"content","url":"/how-to-cite","position":1}]}